Tests/Requests/Request_CalcPrecoPrazo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CalcPrecoPrazo>
         <tem:nCdEmpresa></tem:nCdEmpresa>
         <tem:sDsSenha></tem:sDsSenha>
         <tem:nCdServico>04014</tem:nCdServico>
         <tem:sCepOrigem>88132080</tem:sCepOrigem>
         <tem:sCepDestino>88304140</tem:sCepDestino>
         <tem:nVlPeso>2</tem:nVlPeso>
         <tem:nCdFormato>1</tem:nCdFormato>
         <tem:nVlComprimento>30</tem:nVlComprimento>
         <tem:nVlAltura>10</tem:nVlAltura>
         <tem:nVlLargura>30</tem:nVlLargura>
         <tem:nVlDiametro>30</tem:nVlDiametro>
         <tem:sCdMaoPropria>N</tem:sCdMaoPropria>
         <tem:nVlValorDeclarado>0</tem:nVlValorDeclarado>
         <tem:sCdAvisoRecebimento>S</tem:sCdAvisoRecebimento>
      </tem:CalcPrecoPrazo>
   </soapenv:Body>
</soapenv:Envelope>